README.md
```mermaid
flowchart TD
  subgraph s[ ]
    a[degeneracy order]
    b[first iteration]
    a --> b
  end
  c[nested iteration]
  d[nested iteration]
  e[nested iteration]
  f[nested iteration]
  g[nested iteration]
  h[nested iteration]
  b --> c
  b --> d
  c --> e
  c --> f
  c --> g
  c --> h
  d --> e
  d --> f
  d --> g
  d --> h
```
